NaruesornK/PSOC_Edge_Machine_Learning_DEEPCRAFT_Deploy_Ready_Model/proj_cm55/source/lv_conf.h
/** Stack size of drawing thread.
 * NOTE: If FreeType or ThorVG is enabled, it is recommended to set it to 32KB or more.
 */
#define LV_DRAW_THREAD_STACK_SIZE    (8 * 1024)         /**< [bytes]*/

/** Thread priority of the drawing task.
 *  Higher values mean higher priority.
 *  Can use values from lv_thread_prio_t enum in lv_os.h: LV_THREAD_PRIO_LOWEST,
 *  LV_THREAD_PRIO_LOW, LV_THREAD_PRIO_MID, LV_THREAD_PRIO_HIGH, LV_THREAD_PRIO_HIGHEST
 *  Make sure the priority value aligns with the OS-specific priority levels.
 *  On systems with limited priority levels (e.g., FreeRTOS), a higher value can improve
 *  rendering performance but might cause other tasks to starve. */
#define LV_DRAW_THREAD_PRIO LV_THREAD_PRIO_HIGH

#define LV_USE_DRAW_SW 1
#if LV_USE_DRAW_SW == 1
    /*
     * Selectively disable color format support in order to reduce code size.
     * NOTE: some features use certain color formats internally, e.g.
     * - gradients use RGB888
     * - bitmaps with transparency may use ARGB8888
     */
    #define LV_DRAW_SW_SUPPORT_RGB565       1
    #define LV_DRAW_SW_SUPPORT_RGB565_SWAPPED           0
    #define LV_DRAW_SW_SUPPORT_RGB565A8     0 /* Not used - saves ITCM */
    #define LV_DRAW_SW_SUPPORT_RGB888       0 /* Not used - saves ITCM */
    #define LV_DRAW_SW_SUPPORT_XRGB8888     0 /* Not used - saves ITCM */
    #define LV_DRAW_SW_SUPPORT_ARGB8888     1
    #define LV_DRAW_SW_SUPPORT_ARGB8888_PREMULTIPLIED   0
    #define LV_DRAW_SW_SUPPORT_L8           0 /* Not used - saves ITCM */
    #define LV_DRAW_SW_SUPPORT_AL88         0 /* Not used - saves ITCM */
    #define LV_DRAW_SW_SUPPORT_A8           0 /* Not used - saves ITCM */
    #define LV_DRAW_SW_SUPPORT_I1           0 /* Not used - saves ITCM */

    /* The threshold of the luminance to consider a pixel as
     * active in indexed color format */
    #define LV_DRAW_SW_I1_LUM_THRESHOLD 127

    /** Set number of draw units.
     *  - > 1 requires operating system to be enabled in `LV_USE_OS`.
     *  - > 1 means multiple threads will render the screen in parallel. */
    #define LV_DRAW_SW_DRAW_UNIT_CNT    1

    /** Use Arm-2D to accelerate software (sw) rendering. */
    #define LV_USE_DRAW_ARM2D_SYNC      0

    /** Enable native helium assembly to be compiled. */
    #ifdef __ICCARM__
        #define LV_USE_NATIVE_HELIUM_ASM    0
    #else
        #define LV_USE_NATIVE_HELIUM_ASM    1
    #endif

    /**
     * - 0: Use a simple renderer capable of drawing only simple rectangles with gradient, images, text, and straight lines only.
     * - 1: Use a complex renderer capable of drawing rounded corners, shadow, skew lines, and arcs too. */
    #define LV_DRAW_SW_COMPLEX          1

    #if LV_DRAW_SW_COMPLEX == 1
        /** Allow buffering some shadow calculation.
         *  LV_DRAW_SW_SHADOW_CACHE_SIZE is the maximum shadow size to buffer, where shadow size is
         *  `shadow_width + radius`.  Caching has LV_DRAW_SW_SHADOW_CACHE_SIZE^2 RAM cost. */
        #define LV_DRAW_SW_SHADOW_CACHE_SIZE 128

        /** Set number of maximally-cached circle data.
         *  The circumference of 1/4 circle are saved for anti-aliasing.
         *  `radius * 4` bytes are used per circle (the most often used radiuses are saved).
         *  - 0: disables caching */
        #define LV_DRAW_SW_CIRCLE_CACHE_SIZE 32
    #endif

    /* IAR assembler cannot process GCC-style .S files used by helium blend */
    #ifdef __ICCARM__
        #define  LV_USE_DRAW_SW_ASM     LV_DRAW_SW_ASM_NONE
    #else
        #define  LV_USE_DRAW_SW_ASM     LV_DRAW_SW_ASM_HELIUM
    #endif

    #if LV_USE_DRAW_SW_ASM == LV_DRAW_SW_ASM_CUSTOM
        #define  LV_DRAW_SW_ASM_CUSTOM_INCLUDE ""
    #endif

    /** Enable drawing complex gradients in software: linear at an angle, radial or conical */
    #define LV_USE_DRAW_SW_COMPLEX_GRADIENTS    0

#endif

/** Use Renesas Dave2D on RA  platforms. */
#define LV_USE_DRAW_DAVE2D 0

/** Draw using cached SDL textures*/
#define LV_USE_DRAW_SDL 0

/** Use VG-Lite GPU. */
#define LV_USE_DRAW_VG_LITE 1
#if LV_USE_DRAW_VG_LITE
    /** Enable VG-Lite custom external 'gpu_init()' function */
    #define LV_VG_LITE_USE_GPU_INIT 0

    /** Enable VG-Lite assert. */
    #if LV_USE_DEMO_BENCHMARK
        #define LV_VG_LITE_USE_ASSERT 0
    #else
        #define LV_VG_LITE_USE_ASSERT 1
    #endif

    /** VG-Lite flush commit trigger threshold. GPU will try to batch these many draw tasks. */
    #define LV_VG_LITE_FLUSH_MAX_COUNT 16

    /** Enable border to simulate shadow.
     *  NOTE: which usually improves performance,
     *  but does not guarantee the same rendering quality as the software. */
    #if LV_USE_DEMO_BENCHMARK
        #define LV_VG_LITE_USE_BOX_SHADOW 1
    #else
        #define LV_VG_LITE_USE_BOX_SHADOW 0
    #endif

    /** VG-Lite gradient maximum cache number.
     *  @note  The memory usage of a single gradient image is 4K bytes. */
    #define LV_VG_LITE_GRAD_CACHE_CNT 32

    /** VG-Lite stroke maximum cache number. */
    #define LV_VG_LITE_STROKE_CACHE_CNT 32

    /** VG-Lite unaligned bitmap font maximum cache number. */
    #define LV_VG_LITE_BITMAP_FONT_CACHE_CNT 256

    /** Remove VLC_OP_CLOSE path instruction (Workaround for NXP) **/
    #define LV_VG_LITE_DISABLE_VLC_OP_CLOSE 0

    /** Disable blit rectangular offset to resolve certain hardware errors. */
    #define LV_VG_LITE_DISABLE_BLIT_RECT_OFFSET 0

    /** Disable linear gradient extension for some older versions of drivers. */
    #define LV_VG_LITE_DISABLE_LINEAR_GRADIENT_EXT 0

    /** Maximum path dump print length (in points) */
    #define LV_VG_LITE_PATH_DUMP_MAX_LEN 1000

    /** Enable usage of the LVGL's built-in vg_lite driver */
    #define LV_USE_VG_LITE_DRIVER  0
    #if LV_USE_VG_LITE_DRIVER
        /** Used to pick the correct GPU series folder valid options are gc255, gc355 and gc555*/
        #define LV_VG_LITE_HAL_GPU_SERIES gc255

        /** Used to pick the correct GPU revision header it depends on the vendor */
        #define LV_VG_LITE_HAL_GPU_REVISION 0x40A

        /** Base memory address of the GPU IP it depends on SoC,
         *  default value is for NXP based devices */
        #define LV_VG_LITE_HAL_GPU_BASE_ADDRESS 0x40240000
    #endif /*LV_USE_VG_LITE_DRIVER*/

    /** Use ThorVG (a software vector library) as VG-Lite driver to allow testing VGLite on PC
     *  Requires: LV_USE_THORVG_INTERNAL or LV_USE_THORVG_EXTERNAL */
    #define LV_USE_VG_LITE_THORVG   0
    #if LV_USE_VG_LITE_THORVG
        /** Enable LVGL's blend mode support */
        #define LV_VG_LITE_THORVG_LVGL_BLEND_SUPPORT 0

        /** Enable YUV color format support */
        #define LV_VG_LITE_THORVG_YUV_SUPPORT 0

        /** Enable Linear gradient extension support */
        #define LV_VG_LITE_THORVG_LINEAR_GRADIENT_EXT_SUPPORT 0

