NaruesornK/PSOC_Edge_Machine_Learning_DEEPCRAFT_Deploy_Ready_Model/proj_cm55/source/lv_conf.h
        /** Enable alignment on 16 pixels */
        #define LV_VG_LITE_THORVG_16PIXELS_ALIGN 1

        /** Buffer address alignment */
        #define LV_VG_LITE_THORVG_BUF_ADDR_ALIGN 64

        /** Enable multi-thread render */
        #define LV_VG_LITE_THORVG_THREAD_RENDER 0
    #endif /*LV_USE_VG_LITE_THORVG*/
#endif

/** Accelerate blends, fills, etc. with STM32 DMA2D */
#define LV_USE_DRAW_DMA2D 0
#if LV_USE_DRAW_DMA2D
    #define LV_DRAW_DMA2D_HAL_INCLUDE "stm32h7xx_hal.h"

    /* if enabled, the user is required to call `lv_draw_dma2d_transfer_complete_interrupt_handler`
     * upon receiving the DMA2D global interrupt
     */
    #define LV_USE_DRAW_DMA2D_INTERRUPT 0
#endif

/** Draw using cached OpenGLES textures. Requires LV_USE_OPENGLES */
#define LV_USE_DRAW_OPENGLES 0
#if LV_USE_DRAW_OPENGLES
    #define LV_DRAW_OPENGLES_TEXTURE_CACHE_COUNT 64
#endif

/** Draw using espressif PPA accelerator */
#define LV_USE_PPA  0
#if LV_USE_PPA
    #define LV_USE_PPA_IMG      0
    #define LV_PPA_BURST_LENGTH    128
#endif

/* Use EVE FT81X GPU. */
#define LV_USE_DRAW_EVE 0
#if LV_USE_DRAW_EVE
    /* EVE_GEN value: 2, 3, or 4 */
    #define LV_DRAW_EVE_EVE_GENERATION 4

    /* The maximum number of bytes to buffer before a single SPI transmission.
     * Set it to 0 to disable write buffering.
     */
    #define LV_DRAW_EVE_WRITE_BUFFER_SIZE 2048
#endif

/** Use NanoVG Renderer
 * - Requires LV_USE_NANOVG, LV_USE_MATRIX.
 */
#define LV_USE_DRAW_NANOVG 0
#if LV_USE_DRAW_NANOVG
    /** Select OpenGL backend for NanoVG:
     * - LV_NANOVG_BACKEND_GL2:   OpenGL 2.0
     * - LV_NANOVG_BACKEND_GL3:   OpenGL 3.0+
     * - LV_NANOVG_BACKEND_GLES2: OpenGL ES 2.0
     * - LV_NANOVG_BACKEND_GLES3: OpenGL ES 3.0+
     */
    #define LV_NANOVG_BACKEND   LV_NANOVG_BACKEND_GLES2

    /** Draw image texture cache count. */
    #define LV_NANOVG_IMAGE_CACHE_CNT 128

    /** Draw letter texture cache count. */
    #define LV_NANOVG_LETTER_CACHE_CNT 512
#endif

/*=======================
 * FEATURE CONFIGURATION
 *=======================*/

/*-------------
 * Logging
 *-----------*/

/** Enable log module */
#if LV_USE_DEMO_BENCHMARK
/*Logging is enabled by default for the benchmark demo. */
#define LV_USE_LOG 1
#else
#define LV_USE_LOG 0
#endif
#if LV_USE_LOG
    /** Set value to one of the following levels of logging detail:
     *  - LV_LOG_LEVEL_TRACE    Log detailed information.
     *  - LV_LOG_LEVEL_INFO     Log important events.
     *  - LV_LOG_LEVEL_WARN     Log if something unwanted happened but didn't cause a problem.
     *  - LV_LOG_LEVEL_ERROR    Log only critical issues, when system may fail.
     *  - LV_LOG_LEVEL_USER     Log only custom log messages added by the user.
     *  - LV_LOG_LEVEL_NONE     Do not log anything. */
    #if LV_USE_DEMO_BENCHMARK
        #define LV_LOG_LEVEL LV_LOG_LEVEL_ERROR
    #else
        #define LV_LOG_LEVEL LV_LOG_LEVEL_WARN
    #endif

    /** - 1: Print log with 'printf';
     *  - 0: User needs to register a callback with `lv_log_register_print_cb()`. */
    #define LV_LOG_PRINTF 1

    /** Set callback to print logs.
     *  E.g `my_print`. The prototype should be `void my_print(lv_log_level_t level, const char * buf)`.
     *  Can be overwritten by `lv_log_register_print_cb`. */
    //#define LV_LOG_PRINT_CB

    /** - 1: Enable printing timestamp;
     *  - 0: Disable printing timestamp. */
    #define LV_LOG_USE_TIMESTAMP 1

    /** - 1: Print file and line number of the log;
     *  - 0: Do not print file and line number of the log. */
    #define LV_LOG_USE_FILE_LINE 1

    /* Enable/disable LV_LOG_TRACE in modules that produces a huge number of logs. */
    #define LV_LOG_TRACE_MEM        1   /**< Enable/disable trace logs in memory operations. */
    #define LV_LOG_TRACE_TIMER      1   /**< Enable/disable trace logs in timer operations. */
    #define LV_LOG_TRACE_INDEV      1   /**< Enable/disable trace logs in input device operations. */
    #define LV_LOG_TRACE_DISP_REFR  1   /**< Enable/disable trace logs in display re-draw operations. */
    #define LV_LOG_TRACE_EVENT      1   /**< Enable/disable trace logs in event dispatch logic. */
    #define LV_LOG_TRACE_OBJ_CREATE 1   /**< Enable/disable trace logs in object creation (core `obj` creation plus every widget). */
    #define LV_LOG_TRACE_LAYOUT     1   /**< Enable/disable trace logs in flex- and grid-layout operations. */
    #define LV_LOG_TRACE_ANIM       1   /**< Enable/disable trace logs in animation logic. */
    #define LV_LOG_TRACE_CACHE      1   /**< Enable/disable trace logs in cache operations. */
#endif  /*LV_USE_LOG*/

/*-------------
 * Asserts
 *-----------*/

/* Enable assertion failures if an operation fails or invalid data is found.
 * If LV_USE_LOG is enabled, an error message will be printed on failure. */
#define LV_USE_ASSERT_NULL          1   /**< Check if the parameter is NULL. (Very fast, recommended) */
#define LV_USE_ASSERT_MALLOC        1   /**< Checks is the memory is successfully allocated or no. (Very fast, recommended) */
#define LV_USE_ASSERT_STYLE         0   /**< Check if the styles are properly initialized. (Very fast, recommended) */
#define LV_USE_ASSERT_MEM_INTEGRITY 0   /**< Check the integrity of `lv_mem` after critical operations. (Slow) */
#define LV_USE_ASSERT_OBJ           0   /**< Check the object's type and existence (e.g. not deleted). (Slow) */

/** Add a custom handler when assert happens e.g. to restart MCU. */
#define LV_ASSERT_HANDLER_INCLUDE <stdint.h>
#define LV_ASSERT_HANDLER while(1);     /**< Halt by default */

/*-------------
 * Debug
 *-----------*/

/** 1: Draw random colored rectangles over the redrawn areas. */
#define LV_USE_REFR_DEBUG 0

/** 1: Draw a red overlay for ARGB layers and a green overlay for RGB layers*/
#define LV_USE_LAYER_DEBUG 0

/** 1: Adds the following behaviors for debugging:
 *  - Draw overlays with different colors for each draw_unit's tasks.
 *  - Draw index number of draw unit on white background.
 *  - For layers, draws index number of draw unit on black background. */
#define LV_USE_PARALLEL_DRAW_DEBUG 0

/*-------------
 * Others
 *-----------*/

